---
kind: enumMember
id: F:Autodesk.Revit.DB.TessellatedShapeBuilderFallback.Salvage
enum: Autodesk.Revit.DB.TessellatedShapeBuilderFallback
source: html/ce755fa3-8727-2cd3-dbc3-c952bdc83a17.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilderFallback.Salvage

Ignore invalid data, and use all valid data. Note that if a complete set
 of data describes a solid and some data are ignored, then the result
 will be a sheet and not a solid.